const x = 100;

console.log(
  (x + '200').slice(2).length
);
// Пояснення:

// 100 перетворюється на рядок, оскільки другий аргумент є рядком. Отже:

//     100 + '200' === '100' + '200' === '100200'

// В Javascript ми можемо запускати методи та читати властивості результату виразу без створення змінної. Отже:

//     '100200'.slice(2) === '0200'
//     '0200'.length === 4

(function(x, y) {
  console.log(x + y);
})(2, 3);
// Пояснення:

// Можемо розділити вираз на дві частини:

//     Зберігаємо функцію з першої пари дужок в змінну.
//     Використовуємо цю змінну замість функції у дужках.

// const f = function(x, y) {
//     console.log(x + y);
// };
// (f)(2, 3);

// Це еквівалентно f(2, 3). Отже, консоль виведе результат 2 + 3, тобто 5.
